document.addEventListener('DOMContentLoaded', () => {
    const factElement = document.getElementById('fact');
    
    const facts = {
        northFact: `
            <h3>شمالی پنجاب</h3>
            <ul>
                <li>کچنار، پھلائی، کیل، اخروٹ، بادام، دیودار، اوک</li>
                <li>کھیت میں کم سایہ دار درخت لگائیں</li>
                <li>سفیدہ: خراب زمین کے لئے، روزانہ 25 لیٹر پانی</li>
            </ul>
            <h3>خیبر پختونخواہ اور شمالی علاقہ جات</h3>
            <ul>
                <li>شیشم، دیودار، پاپولر، کیکر، ملبری، چنار، پائن</li>
            </ul>
        `,
        centralFact: `
            <h3>وسطی پنجاب</h3>
            <ul>
                <li>املتاس، شیشم، جامن، توت، سمبل، پیپل، بکاین، ارجن، لسوڑا</li>
            </ul>
        `,
        southFact: `
            <h3>جنوبی پنجاب</h3>
            <ul>
                <li>بیری، شریں، سوہانجنا، کیکر، پھلائی، کھجور، ون، جنڈ، فراش</li>
                <li>آم</li>
            </ul>
            <h3>سندھ</h3>
            <ul>
                <li>ساحلی علاقے: پام ٹری، کھجور</li>
                <li>کراچی: املتاس، برنا، نیم، گلمہور، جامن، پیپل، بینیان، ناریل، اشوکا</li>
                <li>اندرون سندھ: کیکر، بیری، پھلائی، ون، فراش، سہانجنا، آسٹریلین کیکر</li>
            </ul>
            <p>کراچی میں کونو کارپس غیر موزوں: پولن الرجی، منفی اثرات</p>
            <h3>بلوچستان</h3>
            <ul>
                <li>زیارت: صنوبر</li>
                <li>دیگر علاقے: ون، کرک، پھلائی، کیر، بڑ، چلغوزہ، پائن، اولیو، ایکیکا</li>
            </ul>
        `
    };
    
    const regions = document.querySelectorAll('.region');
    
    regions.forEach(region => {
        region.addEventListener('mouseover', () => {
            const factId = region.getAttribute('data-fact');
            factElement.innerHTML = facts[factId];
            region.style.opacity = 1;
        });
        
        region.addEventListener('mouseout', () => {
            factElement.innerHTML = `<div class="container2">
                <div class="columns">
                    <div class="column">
                        <h3>درخت لگانے کا بہترین وقت</h3>
                        <p>مہینے: فروری-مارچ، اگست-ستمبر</p>

                        <h3>درخت لگانے اور حفاظت کے طریقے</h3>
                        <h4>فاصلے:</h4>
                        <p>سکول، کالج یا پارک: 10-15 فٹ، گھر: دیوار سے دور</p>
                        <p>پودا لگانے کا وقت: صبح یا شام</p>
                        <h4>پانی دینا:</h4>
                        <p>گرمیوں میں: ایک دن چھوڑ کر، سردیوں میں: ہفتے میں دو بار</p>
                        <p>جڑی بوٹی نکالنا: کھرپے سے</p>
                    </div>
                    <div class="column">

                        <h4>کھاد:</h4>
                        <p>گھر کی بنی ہوئی یا یوریا فاسفورس والی، زیادہ مقدار نقصان دہ</p>
                        <h4>جلدی بڑھنے والے درخت:</h4>
                        <p>سفیدہ، پاپولر، سنبل، شیشم</p>
                        <h4>دیر سے بڑھنے والے درخت:</h4>
                        <p>دیودار، دیگر پہاڑی درخت</p>
                        <h4>گھروں میں موزوں درخت:</h4>
                        <p>شہتوت، جامن، سہانجنا، املتاس، بکائن، نیم</p>
                    </div>
                </div>
            </div>
            `;
            region.style.opacity = 0.3;
        });
    });
});
